; domain
; move precondition updated to prevent moving from and to the same location
(define (domain briefcase)
(:requirements :typing :negative-preconditions :conditional-effects)
(:types portable location)
(:predicates (at ?y - portable ?x - location)
             (in ?x - portable)
             (is-at ?x - location))


(:action move
  :parameters (?m ?l - location)
  :precondition  (and (is-at ?m)(not (is-at ?l)))
  :effect (and (is-at ?l) (not (is-at ?m))
		    (forall (?x - portable) (when (in ?x)
		      (and (at ?x ?l) (not (at ?x ?m)))))))

  (:action take-out
      :parameters (?x - portable)
      :precondition (in ?x)
      :effect (not (in ?x)))
      
  (:action put-in
      :parameters (?x - portable ?l - location)
      :precondition (and (not (in ?x)) (at ?x ?l) (is-at ?l))
      :effect (in ?x)))

; problem
(define (problem briefcase-o4)
(:domain briefcase)
(:objects l0 l1 l2 l3 l4 - location
          o0 o1 o2 o3 - portable)
(:init
(at o0 l2)
(at o1 l0)
(at o2 l3)
(at o3 l4)
(is-at l3)
)
(:goal
(and
(at o0 l4)
(at o1 l2)
(at o2 l4)
(at o3 l3)
(is-at l2)
)
)
)

; plan
1. (move l3 l0)
   deleted: (is-at l3)
   added: (is-at l0)
   goals met: 0 of 5
2. (put-in o1 l0)
   added: (in o1)
   goals met: 0 of 5
3. (move l0 l2)
   deleted: (is-at l0) (at o1 l0)
   added: (is-at l2) (at o1 l2)
   goals met: 2 of 5
4. (take-out o1)
   deleted: (in o1)
   goals met: 2 of 5
5. (put-in o0 l2)
   added: (in o0)
   goals met: 2 of 5
6. (move l2 l3)
   deleted: (is-at l2) (at o0 l2)
   added: (is-at l3) (at o0 l3)
   goals met: 1 of 5
7. (put-in o2 l3)
   added: (in o2)
   goals met: 1 of 5
8. (move l3 l0)
   deleted: (is-at l3) (at o0 l3) (at o2 l3)
   added: (is-at l0) (at o0 l0) (at o2 l0)
   goals met: 1 of 5
9. (move l0 l2)
   deleted: (is-at l0) (at o0 l0) (at o2 l0)
   added: (is-at l2) (at o0 l2) (at o2 l2)
   goals met: 2 of 5
10. (move l2 l4)
   deleted: (is-at l2) (at o0 l2) (at o2 l2)
   added: (is-at l4) (at o0 l4) (at o2 l4)
   goals met: 3 of 5
11. (put-in o3 l4)
   added: (in o3)
   goals met: 3 of 5
12. (move l4 l3)
   deleted: (is-at l4) (at o0 l4) (at o2 l4) (at o3 l4)
   added: (is-at l3) (at o0 l3) (at o2 l3) (at o3 l3)
   goals met: 2 of 5
13. (take-out o3)
   deleted: (in o3)
   goals met: 2 of 5
14. (move l3 l2)
   deleted: (is-at l3) (at o0 l3) (at o2 l3)
   added: (is-at l2) (at o0 l2) (at o2 l2)
   goals met: 3 of 5
15. (move l2 l4)
   deleted: (is-at l2) (at o0 l2) (at o2 l2)
   added: (is-at l4) (at o0 l4) (at o2 l4)
   goals met: 4 of 5
16. (take-out o2)
   deleted: (in o2)
   goals met: 4 of 5
17. (take-out o0)
   deleted: (in o0)
   goals met: 4 of 5
18. (move l4 l2)
   deleted: (is-at l4)
   added: (is-at l2)
   goals met: 5 of 5
